{
  "modals": {
    "roadmap": {
      "title": "Roadmap"
    }
  },
  "toasts": {
    "title": "New update",
    "description": {
      "content": "New items have been added from the latest Granblue Fantasy update.",
      "feature": "Now you can remix other people's teams, add Character rings and earrings, set Shields and Manatura on parties, and more!"
    },
    "button": "Learn more"
  },
  "title": "Roadmap",
  "subtitle": "Next update",
  "blurb": "I'm aiming for this update to release between late-January and early-February. I'm losing a week to top 2k in Guild Wars and after that I'm back at my full-time job, so progress will be a bit slower.",
  "link": {
    "intro": "You can see the full roadmap on Github below:",
    "title": "granblue.team Roadmap"
  },
  "roadmap": {
    "item1": {
      "title": "Remix teams",
      "description": "See a team you want to riff off of? This update will let you remix other teams, which will add a copy to your account to make something new."
    },
    "item2": {
      "title": "Character mods",
      "description": "This update will allow you to add rings, earrings, perpetuity rings and awakenings to your characters."
    },
    "item3": {
      "title": "Remove from grid",
      "description": "This update will allow you to remove characters, summons, or weapons from your grid."
    },
    "item4": {
      "title": "Transcendence",
      "description": "This update will allow you to set which transcendence stage characters or summons in your team are at."
    },
    "item5": {
      "title": "URL state for team tabs",
      "description": "This update will allow you to append /characters, /weapons, /summons to link to individual tabs, and also /all to see everything at once."
    },
    "item6": {
      "title": "Add R characters",
      "description": "I will spend several hours manually inputting R characters, just for you."
    },
    "item7": {
      "title": "Private and unlisted teams",
      "description": "If you just want to save something for yourself, this update will let you change the visibility of teams so only you or people you share the link with can see them."
    }
  }
}
