{
  "noUpdates": "No updates available for this year",
  "labels": {
    "characters": "New characters",
    "weapons": "New weapons",
    "summons": "New summons",
    "uncaps": {
      "characters": "New character uncaps",
      "weapons": "New weapon uncaps",
      "summons": "New summon uncaps"
    },
    "transcends": {
      "characters": "New character transcendence",
      "weapons": "New weapon transcendence",
      "summons": "New summon transcendence"
    },
    "awakened": {
      "weapons": "New weapon awakenings"
    },
    "jobs": "New classes",
    "raids": "New raids",
    "features": "New features",
    "updates": "Other updates"
  },
  "events": {
    "date": "{month}/{year}",
    "legfest": "Legend Festival",
    "flash": "Flash Gala",
    "content": "Content Update",
    "uncap": "Uncap"
  },
  "versions": {
    "2024-05U1": {
      "features": [
        "Added new raids: Colossus Ira Omega (Impossible) and Celeste Ater Omega (Impossible)",
        "Pendulum of Extremity, Pendulum of Sagacity, and Pendulum of Supremacy added (I kept forgetting about these)",
        "Only Dark Opus Weapons at Transcendence Lv3 or higher can equip the new Pendulums",
        "Fixed a bug where users could not set the awakening level on some Grand weapons"
      ]
    },
    "2024-03U3": {
      "features": [
        "Added new raids: Tiamat Aura Omega (Impossible) and Luminiera Credo Omega (Impossible)",
        "When searching for characters, weapons, and summons, results will now show the item can be transcended",
        "When searching for summons, results will now show whether the summon has a subaura"
      ]
    },
    "2024-02U": {
      "features": [
        "Added new class: Onmyoji",
        "Fixed a bug that prevented filtering job skills by category",
        "Fixed a bug that prevented infinite scrolling in search results"
      ]
    },
    "2024-01L": {
      "features": [
        "Added Ultimate Mastery skills for classes: Cavalier, Relic Buster, Yamato, and Masquerade",
        "Fixed a bug where Telumas could be set on the third slot of Draconic Providence weapons"
      ]
    },
    "2024-01U": {
      "features": [
        "Fixed a bug that prevented logged out users from creating teams if they started from the Character or Summon tabs",
        "Fixed a bug that prevented filtering the Teams, Saved, and Profile pages without selecting a filter twice"
      ]
    },
    "2023-12U2": {
      "features": [
        "Sorry for the longer spaces between updates—life has been a bit busy. Work has gotten a lot busier, I have more social obligations, and am working on another app. I haven't abandoned granblue.team though. Thanks for your patience!",
        "Finally fixed the logic that determines when a conflict occurs between Dark Opus Weapons, Draconic Weapons and Draconic Providence Weapons"
      ]
    },
    "2023-11U": {
      "features": [
        "Added Ultimate Mastery skills for classes: Bandit Tycoon, Nighthound, Monk, and Rising Force"
      ]
    },
    "2023-10U": {
      "features": [
        "Draconic Weapons Providence are not properly implemented yet and cannot be placed into teams with Dark Opus Weapons"
      ]
    },
    "2023-09F": {
      "features": [
        "Added Ultimate Mastery skills for classes: Warlock, Chrysaor, Lumberjack, Robin Hood, and Doctor"
      ]
    },
    "2023-09U": {
      "features": ["Added new Manatura \"Ouroboros Mino\""]
    },
    "v1_2_1": {
      "bugs": [
        "Class accessory popover has been fixed, so Paladin shields and Manadiver manatura can be selected again",
        "The AX skill section no longer shows up in the weapon hovercard if no AX skills are set",
        "The top of the character hovercard has been slightly refined",
        "Fixed a bug that prevented all character over mastery (ring) bonuses from being displayed",
        "Fixed a bug that reset a character's transcendence level if their mastery values are set",
        "Fixed a bug that prevented setting the value for Rupee Gain or EXP Gain AX skills on weapons"
      ]
    },
    "v1_2_0": {
      "notes": "I'm very bad at writing actual release notes, so this is a consolidation of the bigger features released in the last six months. Don't worry: there's some new stuff here too!\nThe next features (in no particular order) will be: a way to define roles and substitutions for characters, a collection tracker and hopefully making progress on guides. That's a lot, but I'll chip away at it bit by bit.\nAs always, if you have any feedback, feel free to reach out in the granblue-tools Discord. Thanks for using granblue.team!",
      "features": [
        {
          "title": "Take a peek into teams",
          "blurb": "Hover over the bottom of a team to see the characters and summons without opening it."
        },
        {
          "title": "New team navigation",
          "blurb": "You can also peek into all the views of a team with the new design at the top of the teams page."
        },
        {
          "title": "Control who can see your team",
          "blurb": "You can now set teams to be public, private, or only visible to people with the link."
        },
        {
          "title": "Rich text editing",
          "blurb": "Now you can use rich text when writing team descriptions. Add bold, italics, links, and more!"
        },
        {
          "title": "Mentions",
          "blurb": "You can also link to individual items in your descriptions. Type @ followed by the name of the item."
        },
        {
          "title": "Inclusion and Exclusion",
          "blurb": "Sick of seeing Ereshkigal? Now you can filter teams by which items appear—or don't appear—in them."
        },
        {
          "title": "Redesigned battle selection",
          "blurb": "Battle selection has been revamped. Search for a battle by name, or filter by whether it's solo, a raid, or event-based."
        },
        {
          "title": "Search views",
          "blurb": "Now you can choose to see either recently used items or the newest items when adding weapons and summons"
        },
        {
          "title": "Quick summons",
          "blurb": "Specify which summon is set as the quick summon and specify auto-summon settings in Battle settings."
        },
        {
          "title": "Grand awakenings",
          "blurb": "Now you can set which Grand weapons you spent cages on for a little extra power."
        }
      ]
    },
    "2023-08F": {
      "features": ["Added new class \"Street King\""]
    },
    "2023-05L": {
      "features": ["A large update is in the works. Stay tuned!"]
    },
    "2023-05U": {
      "features": [
        "Added Ultimate Mastery skills for classes: Sage, Chaos Ruler, Elysian, Glorybringer, Runeslayer"
      ]
    },
    "2023-03U2": {
      "features": ["Added new weapon series, World Series"]
    },
    "2023-03U": {
      "features": [
        "Added Siete HL (raid)",
        "Chaser name corrected (was 'Chase')"
      ]
    },
    "2023-03F": {
      "features": [
        "Added new class \"Yamato\"",
        "Added Ultimate Mastery skills for classes: Berserker, Apsaras, Nekomancer, Kengo",
        "Added raids for Dread Barrage",
        "Renamed \"Guild Wars\" in raid list to \"Unite and Fight\"",
        "Fixed sorting of raids for Dread Barrage and Unite and Fight",
        "Fixed character hovercard showing up behind class image",
        "Fixed an issue where users couldn't edit remixed teams"
      ]
    },
    "2023-02-U2": {
      "features": ["Added official names for Proven Weapons and Revans Weapons"]
    },
    "v1_1_0": {
      "features": [
        {
          "title": "Remix parties",
          "blurb": "See a team you want to try but don't have Yatima? Now you can remix teams from other users to showcase substitutes, swap for items you have, or just give it your own flavor."
        },
        {
          "title": "Accountless team editing",
          "blurb": "Now you can edit parties you create later on, even if you don't make an account. You still won't have a profile, so make sure to bookmark them!"
        },
        {
          "title": "Transcendence",
          "blurb": "Now you can set the transcendence stage for Eternals and select summons (namely, Bahamut)."
        },
        {
          "title": "Shields and Manatura",
          "blurb": "When using Paladin or Manadiver, you can set their respective Shield or Manatura from the button next to the main character."
        },
        {
          "title": "Character Mastery",
          "blurb": "You can now add individual values for your character's rings, earrings, and awakenings. Make sure to set your Perpetuity Rings!"
        },
        {
          "title": "Updated team mechanics",
          "blurb": "Sorry, each party is only big enough for one Beelzebub."
        },
        {
          "title": "R Characters",
          "blurb": "R Characters have been added to the database for your mem—Proving Grounds compositions."
        },
        {
          "title": "Unique URLs for team tabs",
          "blurb": "You can now link to individual tabs directly. The site will do it for you when you copy a URL, or you can append /characters, /weapons or /summons manually."
        },
        {
          "title": "Redesigned navigation",
          "blurb": "The top-navigation has been slightly redesigned. Click the party name to copy its URL!"
        },
        {
          "title": "Update toasts",
          "blurb": "The site will now show an update in the bottom-right corner when new features or content is added."
        }
      ],
      "bugs": [
        "Fixed a bug that caused users to be logged out whenever they restarted their browser",
        "Fixed a bug that caused Dark Opus weapons to permanently disappear when adding them to a party that already had one",
        "Rebuilt the component for Clear Time in party details to have a more predictable user experience",
        "Fixed a bug that made it so you could not set Row IV EMP skills in Row V"
      ]
    },
    "v1_0_1": {
      "features": [
        "Extra party fields: Full Auto, Clear Time, and more",
        "Support for Youtube short URLs",
        "Responsive grids and lots of other mobile fixes",
        "Many other bug fixes"
      ]
    },
    "v1_0_0": {
      "features": [
        "First release!",
        "You can embed Youtube videos now",
        "Better click behavior: right-click to open in a new tab",
        "Manually set dark mode in Account Settings",
        "Lots of bugs squashed"
      ]
    }
  }
}
